app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"
---
  def index
    #if user is trying to access the index of all posts ONLY by a certain author
    if params[:author_id]
      @posts = Author.find(params[:author_id]).posts
    #otherwise user is trying to access the index of all posts (Post.all)
    else
      @posts = Post.all